[{"result": "You approach the murals, your eyes scanning the faded images. The murals depict various scenes from Eldoria's history - the founding of Elden village, the rise of the Eldoria kingdom, the battles fought, and the peace treaties signed. As you move further down the hall, the murals become more cryptic. You notice a mural depicting a group of sages, one of whom resembles Eledor, standing around a circular stone table. They seem to be performing a ritual, their hands raised towards a glowing orb in the center. The orb is marked with a symbol - a circle with a star inside. This symbol is repeated in the final mural, where it is engraved on the door of a grand castle, presumably the Forgotten Kingdom. The murals seem to suggest that the orb is the key to unlocking the secrets of the Forgotten Kingdom.", "new_situation": "Armed with this newfound knowledge, you turn your attention to the three doors. The large, ornate door at the end of the hall bears the same symbol as the one in the murals - a circle with a star inside. The two smaller doors on either side are unmarked. Will you attempt to open the large door with the symbol, or explore the rooms behind the smaller doors first"}, {"result": "As you approach the large, ornate door, you notice the intricate carvings on its surface, depicting scenes of ancient Eldorian kings and queens. You reach out, placing your hand on the cold, weathered metal of the door handle. With a deep breath, you attempt to push the door open. It creaks loudly, echoing throughout the grand hall, but doesn't budge. You try again, putting all your strength into it, but the door remains steadfastly shut. It seems to be locked or barred from the other side.", "new_situation": "You stand before the large, ornate door, its refusal to open a clear obstacle in your path. The two smaller doors on either side of the hall now seem to be your only options. To your left, the door is made of sturdy oak, with a small, round window at the top. Through the window, you can see the flicker of torchlight. To your right, the door is made of iron, with no window or any other feature, save for a large, rusty keyhole. The choice is yours: will you try the oak door with the flickering light, or the iron door with the rusty keyhole?"}]