[{"result": "As you approach the rock formation, you notice that the symbol of the Forgotten Kingdom isn't just carved into the stone, but it's part of a larger, intricate pattern. You trace your fingers over the cold stone, feeling the grooves and indentations. Suddenly, you feel a slight give in the rock beneath your touch. You press harder, and with a grinding noise, a hidden panel slides open, revealing a small cavity within the rock. Inside, you find an ancient scroll, sealed with the same symbol.", "new_situation": "You now hold in your hands a scroll that could potentially hold the secrets of the Forgotten Kingdom. The wind howls louder, as if protesting the unearthing of the ancient secret. The griffon ruffles its feathers, sensing the change in the atmosphere. You need to decide your next move. Will you open the scroll here, in the biting cold of the Eldoria Mountains, or seek shelter first before delving into its contents? The fate of Eledor and the village of Elden depends on your decision."}, {"result": "As your fingers trace the symbol of the Forgotten Kingdom, a soft, warm glow emanates from the rock formation. The symbol pulses with an ancient magic, and the ground beneath you rumbles gently. A hidden passage in the rock formation creaks open, revealing a dark tunnel that descends into the heart of the mountain. The air that wafts out is stale but carries a hint of old parchment and dust, reminiscent of Eledor's study. ", "new_situation": "You stand before the newly revealed passage, a sense of anticipation coursing through your veins. The symbol of the Forgotten Kingdom continues to glow, casting an eerie light on the snow around you. The griffon squawks nervously, its eyes fixed on the dark tunnel. The entrance to the Forgotten Kingdom might be within your reach. You can choose to venture into the tunnel or explore the surrounding area for more clues. The choice is yours, but remember, time is of the essence, and Eledor's fate hangs in the balance."}]