[{"result": "As you step into the tunnel, the temperature drops significantly, and the echo of your footsteps fills the air. The griffon hesitates for a moment before following you, its eyes glowing in the dark. You walk for what seems like hours, the tunnel twisting and turning, leading you deeper into the mountain. Suddenly, you stumble upon a large, ornate door, adorned with symbols similar to the one you found earlier. With a deep breath, you push the door open, revealing a vast, ancient city hidden within the mountain. The Forgotten Kingdom.", "new_situation": "The city is eerily quiet, save for the distant sound of dripping water. Buildings made of stone and adorned with intricate carvings tower above you, their tops lost in the darkness. The griffon squawks softly, its gaze fixed on a large, central building that stands taller than the rest. This could be where Eledor is being held. You can choose to explore the city, head straight to the central building, or try to find a place to rest and gather your strength. The choice is yours, but remember, Eledor's life is in your hands."}, {"result": "You decide to explore the surrounding area before venturing into the tunnel. The snow crunches under your boots as you circle the entrance, your eyes scanning the ground for any signs or clues. You notice a set of tracks leading away from the tunnel, partially covered by fresh snow. They are unlike any creature's tracks you've seen before, large and clawed. The griffon squawks in alarm, its eyes following your gaze. You also find a broken piece of a staff, similar to the one Eledor always carried. It's a chilling reminder of your mentor's disappearance.", "new_situation": "You now have a new lead to follow. The strange tracks and the broken staff piece suggest that Eledor might have been here. You can choose to follow the tracks, hoping they lead you to Eledor, or you can venture into the tunnel, the potential entrance to the Forgotten Kingdom. The griffon squawks again, its gaze alternating between the tunnel and the tracks. The choice is yours."}]